{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Bonfire",
  "language": "en",
  "home_page_url": "https://bonfirenetworks.org/",
  "feed_url": "https://bonfirenetworks.org/feed/feed.json",
  "description": "A federated social network for individuals and communities to design, operate and control their own digital lives.",
  "author": {
    "name": "bonfire",
    "url": "https://bonfirenetworks.org"
  },
  "items": [{
      "id": "https://bonfirenetworks.org/posts/bonfire_coordination/",
      "url": "https://bonfirenetworks.org/posts/bonfire_coordination/",
      "title": "First steps toward federated project coordination",
      "content_html": "<h3 id=\"tl%3Bdr\">tl;dr <a class=\"direct-link\" href=\"#tl%3Bdr\">#</a></h3>\n<p>In March 2021, the Bonfire project was fortunate enough to be chosen for a <a href=\"https://nlnet.nl/discovery/\">&quot;Next Generation Search &amp; Discovery&quot; grant</a> from NLNet Foundation, and since then the team has been working on a series of Bonfire extensions to help create the next generation of content on the fediverse.</p>\n<p>This is the first of a series of posts discussing the development process, work coordination strategies and the challenges we are currently facing.</p>\n<p>One of the funded <a href=\"https://github.com/bonfire-networks/bonfire-app/milestone/7\">milestones</a> led us to build a project coordination app as a bonfire extension and <a href=\"https://bonfirenetworks.org/apps/\">flavour</a>.</p>\n<h2 id=\"but-wait%3A-why-are-you-building-another-project-coordination-app%3F\">But wait: why are you building another project coordination app? <a class=\"direct-link\" href=\"#but-wait%3A-why-are-you-building-another-project-coordination-app%3F\">#</a></h2>\n<p><img src=\"https://i.imgur.com/VFz9YMY.png\" alt=\"\"></p>\n<p>Our coordination tool shares a lot of functionality with most to-do apps out there - you can create lists, add tasks to lists, commit to complete work, set a due date, and so on...</p>\n<p><em>So how is this different?</em></p>\n<h3 id=\"1)-we-want-to-federate-coordination-between-many-people%2C-groups-and-organisations-on-different-instances\">1) We want to federate coordination between many people, groups and organisations on different instances <a class=\"direct-link\" href=\"#1)-we-want-to-federate-coordination-between-many-people%2C-groups-and-organisations-on-different-instances\">#</a></h3>\n<p>On top of the usual features like writing posts, following users and browsing feeds, a Bonfire instance using the coordination extension will make it possible to create lists and tasks. Users can then favourite, boost, comment, flag and adjust the visibility settings (or in the case of a Bonfire instance, choose the boundaries and circles their lists and tasks are published to).</p>\n<p>As soon as users start publishing tasks, a new type of activity appears in the feeds like below:</p>\n<p><img src=\"https://i.imgur.com/E2Gu7s6.jpg\" alt=\"\"></p>\n<p>Users can interact with such activities by assigning a task to themselves, searching for tasks that fit with their skills or interests, or following a task to be notified about future discussions or progress.</p>\n<p>Users from any instance can thus start <strong>planning</strong> together: sofware projects, events, creative collaborations, peer production, etc - without having to leave the app and with the same account they already use.</p>\n<p>A user can decide to create a private list to share with specific people, or open it to all users of their instance or beyond. At every point the user will be able to control both the visibility (who can see todos or comments), as well as the permissions and roles for each list and task (who can add/edit/comment/vote/assign/etc).</p>\n<h3 id=\"2)-we-needed-it\">2) We needed it <a class=\"direct-link\" href=\"#2)-we-needed-it\">#</a></h3>\n<p>We are always seeking to improve the coordination between  contributors and the various projects linked to Bonfire. We aim to iterate on the design and build a p2p coordination system that we are happy to work with and would welcome other non-hierarchical and cooperative-minded groups to join us in designing and building these tools together.</p>\n<h3 id=\"3)-interoperability\">3) Interoperability <a class=\"direct-link\" href=\"#3)-interoperability\">#</a></h3>\n<h4 id=\"powered-by-valueflows\">Powered by ValueFlows <a class=\"direct-link\" href=\"#powered-by-valueflows\">#</a></h4>\n<p>We are building upon a well designed and tested <a href=\"https://valueflo.ws/\">vocabulary</a> to bring p2p coordination to a whole new level. In short, ValueFlows does for economic activities what <a href=\"https://www.w3.org/TR/activitystreams-core/#introduction\">ActivityStreams</a> (the main vocabulary of the <a href=\"https://activitypub.rocks/\">ActivityPub</a>-powered fediverse) does for social activities. Using these standard vocabularies means that every feature and user interaction can federate not only with other Bonfire instances, but also with instances of other software which implement them.</p>\n<p>Lists (which can represent projects or milestones within a larger project) can include dependencies from other lists, as well as tracking work, but also resources, shared inventories and needs (this ties in to our work around mutual aid, which will be the topic of a future blog post).</p>\n<p>Users can have discussions around a task, as well as record different kinds of economic activities to keep track of physical or digital resources. They can also simply log the amount of hours or the outputs (eg. git commits) of their work on a specific task.</p>\n<p>Furthermore, it will be possible to define formulas (aka <a href=\"https://valueflo.ws/appendix/equations.html\">value equations</a>) to help calculate the distribution of value generated by a project to all of its participants, based on their recorded contributions and previous agreements.</p>\n<p>So what looks on the surface like another to-do list app, is actually a small UI layer (the <a href=\"https://github.com/bonfire-networks/bonfire_ui_coordination\">bonfire_ui_coordination</a> extension, with only 1110 lines of code) on top of larger and more general economic extensions which are poised to be used for many different kinds of applications. These are <a href=\"https://github.com/bonfire-networks/bonfire_ui_valueflows\">bonfire_ui_valueflows</a> (which currently has over 2500 lines of reusable UI components) and <a href=\"https://github.com/bonfire-networks/bonfire_valueflows\">bonfire_valueflows</a> (sitting at a whopping 16150 lines of database and API schemas and logic), and <a href=\"https://bonfirenetworks.org/extensions/\">many more</a>...</p>\n<h4 id=\"forgefed\">ForgeFed <a class=\"direct-link\" href=\"#forgefed\">#</a></h4>\n<p>Besides ValueFlows, we plan to participate in the <a href=\"https://forgefed.peers.community/\">ForgeFed</a> effort.</p>\n<blockquote>\n<p>ForgeFed is an upcoming federation protocol for enabling interoperability between version control services. It is built as an extension to the ActivityPub protocol, allowing users of any ForgeFed-compliant service to interact with the repositories hosted on other instances.<br>\nThe goal of the project is to support all of the major activities connected to project management, including bug reports, merge requests and notifications across instances.</p>\n</blockquote>\n<p>Given that we are coordinating our development using this tool, it makes sense to connect the dots between issue reporting and work coordination, code contributions (version control and merge requests) and economic contributions (along with the related value calculations). We hope to implement ForgeFed functionality to do more of this and interoperate with other tools in the near future.</p>\n<h2 id=\"join-us!\">Join us! <a class=\"direct-link\" href=\"#join-us!\">#</a></h2>\n<p>Would you be interested in trying alpha-stage software and participate in its design and creation process? These tools are still missing some important features, several of which we've committed to build as part of other milestones, and we greatly appreciate your input about how to design and build it futher according to your needs. Please get in touch.</p>\n",
      "date_published": "2021-07-14T00:00:00Z"
    },{
      "id": "https://bonfirenetworks.org/posts/bonfire_identity/",
      "url": "https://bonfirenetworks.org/posts/bonfire_identity/",
      "title": "The story of Bonfire&#39;s visual identity",
      "content_html": "<blockquote>\n<p>Everyone carries a history of contamination, purity is not an option.</p>\n</blockquote>\n<p>This short statement by <a href=\"https://en.wikipedia.org/wiki/Anna_Tsing\">Anna Tsing</a> in <a href=\"https://en.wikipedia.org/wiki/The_Mushroom_at_the_End_of_the_World\">Mushroom at the end of the world</a> encompasses a lot of the visions and needs that inspired our work on Bonfire.</p>\n<p>We are building this piece of software for us and for the diverse communities we care about, so we strive for diversity and flexibility in every aspect of the Bonfire codebase.</p>\n<p>We want each Bonfire instance to be autonomous and unique in its own particular way, while having a shared purpose with the other bonfires:</p>\n<blockquote>\n<p>To create safe environments for users to inhabit and create their own culture together, while remaining in control of their personal data and experience, and being able to communicate with the fediverse at their own pace and on their own terms.</p>\n</blockquote>\n<p>It was no surprise that words like <strong>contamination</strong>, <strong>burn</strong>, <strong>revolution</strong>, <strong>rebirth</strong>, <strong>bottom up</strong>, <strong>diverse</strong>, <strong>autonomous</strong>, <strong>nature</strong> and <strong>ecosystem</strong> were among the most used during our brainstorming about Bonfire's visual identity.</p>\n<p>We wanted our visual identity to reflect such ideas without obfuscating itself under an overly sanitised and minimalist design. We enjoy navigating through complexity, without the burning desire to be in control of everything, and wanted to avoid the flat, metallo-plastic, stark, silicon valley style that has dominated the web in recent years.</p>\n<p>Other than a social network, Bonfire is a playground and experimentation platform, we are learning how to take care of it and take care of ourselves - building in the open so that Bonfire can become an ecosystem open to many other peers.</p>\n<p>We had the pleasure to work with <a href=\"http://lalberosfregiato.blogspot.com/\">Rocco Lombardi</a>, a talented artist living somewhere near the Bolognese Apennines, who guided us and turned our wishes into meaningful visual representations of the project.</p>\n<p>We asked Rocco to work on our visual identity primarly because of the style and subjects of his artwork. Forests and trees that emerge by scratching the light away from black paper, animals that fight capitalism, all sort of organics - wild and lived entities contaminate his drawings and we wanted that world to contaminate our software as well.</p>\n<p><img src=\"https://assets.bigcartel.com/product_images/287784678/Squirrels.jpg?auto=format&amp;fit=max&amp;w=600\" alt=\"\"></p>\n<figcaption class=\"-mt-6 italic text-blueGray-400 text-base block\">\"Squirrels on the air\" - Illustration by Rocco Lombardi - <a href=\"https://roccolombardi.bigcartel.com/product/squirrels-on-the-air\" target=\"blank\">Link</a></figcaption>\n<p>The end result is very much in tune with our expectations, and we hope you like it too.</p>\n<p>As we're progressing toward a first release of our software, we are happy to have added this important step and we thank Rocco to have joined us on this journey. :-)</p>\n<img src=\"/img/brand2.png\">\n",
      "date_published": "2021-05-21T00:00:00Z"
    }
  ]
}
