{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Bonfire",
  "language": "en",
  "home_page_url": "https://bonfirenetworks.org/",
  "feed_url": "https://bonfirenetworks.org/feed/feed.json",
  "description": "A federated social network for individuals and communities to design, operate and control their own digital lives.",
  "author": {
    "name": "bonfire",
    "url": "https://bonfirenetworks.org"
  },
  "items": [{
      "id": "https://bonfirenetworks.org/posts/bonfire_cos/",
      "url": "https://bonfirenetworks.org/posts/bonfire_cos/",
      "title": "Bonfire got awarded from the European Cultural foundation",
      "content_html": "<p>We are so pleased to announce that Bonfire has been awarded with the <a href=\"https://culturalfoundation.eu/stories/culture-of-solidarity-fund/\">Culture of Solidarity Fund</a> from the <a href=\"https://culturalfoundation.eu/\">European Cultural foundation</a> to support cross-border cultural initiatives of solidarity in times of uncertainty and infodemic.</p>\n<p>The grant will be used to release our bonfire social beta and to develop Zappa: a custom bonfire extension to empower communities with a dedicated tool to deal with the coronavirus infodemic and online misinformation in general.</p>\n<h2 id=\"the-zappa-extension\">The Zappa extension <a class=\"direct-link\" href=\"#the-zappa-extension\">#</a></h2>\n<p><img src=\"https://www.rollingstone.it/wp-content/uploads/2017/09/frank-zappa.jpg\" alt=\"\"></p>\n<p>Zappa is powered by user communities' assessments of content (links, news, video, pictures) to develop common practices and patterns to fight fake news.<br>\nSuch assessments which will then be used to train artificial intelligence engines. The user ratings and AI predictions will together generate decentralised &quot;Zappa scores&quot;: helping users to classify and act upon content based on each community’s methodology and preferences.<br>\nWe didn't went way more far than this in outlining how zappa will work in details, we all have lot of plans in this regard, but we want to co-design it together with interested communites.<br>\nFor the time being we prefer to <a href=\"https://dougbelshaw.com/ambiguity/\">stay with ambiguity</a> as much as possible, and we welcome you to join the discussion and participate.</p>\n<h2 id=\"how-to-follow-zappa-development%3F\">How to follow zappa development? <a class=\"direct-link\" href=\"#how-to-follow-zappa-development%3F\">#</a></h2>\n<ul>\n<li>We will keep track of our work and deliverables on our <a href=\"https://github.com/bonfire-networks/bonfire-app/milestones\">github milestones</a>.</li>\n<li>Feedbacks and open discussions will take place on the <a href=\"https://socialhub.activitypub.rocks/t/discussing-zappa-a-bonfire-extension-to-deal-with-online-misinformation/2187\">zappa topic</a> on the socialhub forum (we may create several topics when needed)</li>\n<li>You are welcome to join the <a href=\"https://matrix.to/#/#bonfire-networks:matrix.org\">Bonfire public chat</a> and engage with us</li>\n</ul>\n<p>As always, we will report progresses and news here on the bonfire blog, so stay tuned!</p>\n",
      "date_published": "2021-12-26T00:00:00Z"
    },{
      "id": "https://bonfirenetworks.org/posts/notes_on_neapoletan_meeting/",
      "url": "https://bonfirenetworks.org/posts/notes_on_neapoletan_meeting/",
      "title": "Notes on the first neapolitan meeting",
      "content_html": "<div class=\"p-4 text-base text-gray-200 rounded-lg bg-blueGray-600\">\n  The image above is a photo taken at the <a href=\"http://www.exasilofilangieri.it/\" target=\"blank\">ex-asilo filangeri</a>, one of the Neapolitan urban commons. <br> It is a neapolitan way of saying which means: <i>\"every head is a court\"</i>. This article is the first of a set of posts about an hopeful fruitful interaction with a group of neapolitan activists interested in experimenting with bonfire.\n</div>\n<p>As we’re approaching a new phase in which bonfire is not anymore a chimera among few devs, but it’s starting to come together as a nice tool, some of us are anxious to make raids in the analogic world and spread the big news: <strong>bonfire exists!</strong></p>\n<p>Today I visited Naples for the first time after the beginning of the pandemic. I met some friends and discussed about how bonfire could be useful to their communities and practices and how communities and practices can be useful to bonfire.</p>\n<p>There’s many reasons I always thought at Naples as the first place to discuss a possible bonfire adoption, all of them rotate around a single yet powerful concept: contamination.<br>\nIn my experience as a developer, contamination is one of the most feared and therefore dismissed aspect when building a software. Speaking of bonfire, being able to respond and adapt to contamination is its  core value proposition. Needless to say, Naples is the shangri-la of contaminations and I am lucky enough to have friends who navigate this ocean of contaminations and contradictions in a superb way.<br>\nWhen I cite Naples i'm referring to participants of the <a href=\"https://commonsnapoli.org\">urban commons network</a>. Activists that most of the time cross different places, communities and initiatives. In front of the oldest restaurant of Via dei Decumani, we started wondering about the possibility of lighting a few bonfires in Naples.</p>\n<p>Below a list of not exhaustive topics we brainstormed during the day:</p>\n<ul>\n<li><em>There is a general tension to restore practices after the pandemic</em></li>\n<li><em>It's hard for a community already used to communicate/work with a specific software (even if closed source or whatever) to shift to a different one. It's a lot about changing habits, and picking new habits requires trust, energy, time, mental effort...</em></li>\n<li><em>For some users, dealing with huge and complex apps is an overwhelming experience - sometime they just need a little app that solves a functional/pressing issue, leaving everything else aside.</em></li>\n<li><em>Sometime community members have difficulties using even the most trivial/hegemonic/widespread apps like whatsapp, facebook or google drive - or they feel repulsion for the digital world at scale, how could it be possible to not exclude them from the community flow of discussions / coordinations / decisions that takes place online ?</em></li>\n<li><em>Different participants have different priorities and needs about how to be part and be involved with each community and such differences are reflected in the tools they are up to adopt and how they want to use them.</em></li>\n<li><em>Nonetheless it sounds to be a good historic moment for the neapolitan network to bring back the discussion about adopting a platform for the urban commons network.</em></li>\n<li><em>Speaking of using bonfire for coordinating work and productions - there's an on-going, crucial even if sometime stale conversation that gravitate around income, activism, distribution of value and commons goods.</em></li>\n<li><em>Is it possible to envision and approach a software as a common good itself rather than a mere service/product?</em></li>\n<li><em>What would it mean for a software to be a common good?</em></li>\n<li><em>In which ways a community can take care of a software?</em></li>\n<li><em>What would imply for a software to be a common good from the governance perspective?</em></li>\n<li><em>How bonfire can foster co-design and community-driven development?</em></li>\n</ul>\n<h2 id=\"suggestions-for-next-extensions\">Suggestions for next extensions <a class=\"direct-link\" href=\"#suggestions-for-next-extensions\">#</a></h2>\n<p>Current bonfire extensions: Social, Kanban and Offers/Needs - even if still under development - caught the eye because in a way or another they answered current needs of different communities.<br>\nNonetheless during our conversations two new extensions were cited several times as worth to note.</p>\n<h3 id=\"federated-calendar\">Federated calendar <a class=\"direct-link\" href=\"#federated-calendar\">#</a></h3>\n<p>It's hard to coordinate initiatives among different communities and organize events that do not cross existing ones. At today, this requires lot of chats and schedule changes at last moment. Having a federated calendar would allow activists to have a general view across everything that's happening within the network. This would greatly enhance the activities planning and coordination.<br>\nThe calendar should span across different levels: it would allow users to view all the activities planned in the wider network and zoom in/out to specific area/communities, as well as filter for specific topics or date range. We didn't investigate further how such federated calendar should work, but it's all good food for thoughts.</p>\n<h3 id=\"federated-governance\">Federated governance <a class=\"direct-link\" href=\"#federated-governance\">#</a></h3>\n<p>How to take decisions and how to implement a governance system that reflect the community vision was also briefly touched during the brainstorming session. At present some experimentations were made using Framavox and loomio - mostly as a sentiment analysis tool when discussing new proposals.</p>\n<h2 id=\"where-to-go-next\">Where to go next <a class=\"direct-link\" href=\"#where-to-go-next\">#</a></h2>\n<p>During our chats we didn't pretend to answer any of the questions that arose - neither It was the scope of this post. We agreed to meet again in a couple of weeks - bringing more minds to the table - and keep the discussion going as well as start playing with bonfire.</p>\n",
      "date_published": "2021-10-14T00:00:00Z"
    },{
      "id": "https://bonfirenetworks.org/posts/bonfire_ui_social/",
      "url": "https://bonfirenetworks.org/posts/bonfire_ui_social/",
      "title": "A UI toolbox for customizable social network apps",
      "content_html": "<p><a href=\"/extensions/ui_social.html\">Bonfire:UI:Social</a> is an extension that includes the main User Interfaces (both assembled pages and single components) required to have a fully working federated social network app.</p>\n<p>The UI:Social extension is meant to be used by extensions like <a href=\"https://github.com/bonfire-networks/bonfire_social\">Bonfire:Social</a> and <a href=\"https://github.com/bonfire-networks/bonfire_me\">Bonfire:Me</a>, which both provide logic for the UI to work with, and define the routes and top-level views which in turn embed UI:Social components.</p>\n<p>UI:Social also provides components used by other extensions including: <a href=\"https://github.com/bonfire-networks/bonfire_common\">Bonfire:Common</a>, <a href=\"https://github.com/bonfire-networks/bonfire_search\">Bonfire:Search</a>, <a href=\"https://github.com/bonfire-networks/bonfire_tag\">Bonfire:Tag</a>, <a href=\"https://github.com/bonfire-networks/bonfire_boundaries\">Bonfire:Boundaries</a>.</p>\n<h3 id=\"stack\">Stack <a class=\"direct-link\" href=\"#stack\">#</a></h3>\n<p>So far, Bonfire UI extensions are built with the PETALS stack (note that is not a requirement), which means:</p>\n<ul>\n<li><a href=\"https://www.phoenixframework.org/\">Phoenix</a></li>\n<li><a href=\"https://elixir-lang.org/\">Elixir</a></li>\n<li><a href=\"https://tailwindcss.com/\">TailwindCSS</a></li>\n<li><a href=\"https://alpinejs.dev/\">Alpine.js</a></li>\n<li><a href=\"https://github.com/phoenixframework/phoenix_live_view#readme\">LiveView</a></li>\n<li><a href=\"https://surface-ui.org/\">Surface</a></li>\n</ul>\n<p>We're currently in the middle of a refactor to convert all components and templates from LiveView to Surface, which is a server-side rendering component library (built on top of Phoenix and LiveView) that inherits a lot of design patterns from popular JS framework like Vue.js and React, while being almost JavaScript-free compared to common SPAs.</p>\n<h3 id=\"scaffolding\">Scaffolding <a class=\"direct-link\" href=\"#scaffolding\">#</a></h3>\n<p>The relevant folders are:</p>\n<ul>\n<li><a href=\"https://github.com/bonfire-networks/bonfire_ui_social/tree/main/lib/web/components\">Components</a>: Surface stateless and stateful components.</li>\n<li><a href=\"https://github.com/bonfire-networks/bonfire_ui_social/tree/main/lib/web/layout\">Layout</a>: Main app templates, they include guest, logged or specific view templates (eg. the setting layout)</li>\n<li><a href=\"https://github.com/bonfire-networks/bonfire_ui_social/tree/main/lib/web/views\">Views</a>: The main pages that are rendered when navigating to a specific route</li>\n<li><a href=\"https://github.com/bonfire-networks/bonfire_ui_social/tree/main/test\">Test</a>: All the unit tests for the specific module.</li>\n</ul>\n<h3 id=\"other-resources\">Other resources <a class=\"direct-link\" href=\"#other-resources\">#</a></h3>\n<ul>\n<li><a href=\"https://bonfirenetworks.org/posts/let_thousand_bonfires_bloom/\">A blog post that introduces the concept of themeable bonfire apps</a></li>\n</ul>\n",
      "date_published": "2021-07-23T00:00:00Z"
    },{
      "id": "https://bonfirenetworks.org/posts/let_thousand_bonfires_bloom/",
      "url": "https://bonfirenetworks.org/posts/let_thousand_bonfires_bloom/",
      "title": "Let a thousand bonfires bloom",
      "content_html": "<h3 id=\"tl%3Bdr\">tl;dr <a class=\"direct-link\" href=\"#tl%3Bdr\">#</a></h3>\n<p>In March 2021, the Bonfire project was awarded a <a href=\"https://nlnet.nl/discovery/\">&quot;Next Generation Search &amp; Discovery&quot; grant</a> from NLNet Foundation, and since then the team has been working on a series of Bonfire extensions to help create the next generation of federated software.</p>\n<p>This is the second of a series of posts discussing the development process, work coordination strategies and the challenges we are currently facing.</p>\n<p>The first post was about <a href=\"/posts/bonfire_coordination/\">creating a coordination tool.</a>.</p>\n<p>The second <a href=\"https://github.com/bonfire-networks/bonfire-app/milestone/10\">funded milestone</a> was about creating themeable User Interface modules.</p>\n<h2 id=\"why-building-themeable-apps-%3F\">Why building themeable apps ? <a class=\"direct-link\" href=\"#why-building-themeable-apps-%3F\">#</a></h2>\n<p>Dopamine and attention manipulation are not inherent properties of a social network. They can be replaced by healthier behaviours and other ways of connecting humans and exploring collective intelligence.</p>\n<p>It is time to reconsider questions like:</p>\n<ul>\n<li>What should appear in my feed?</li>\n<li>Are number of likes and followers important to me?</li>\n<li>What do I want to be notified about?</li>\n<li>How do we want to take decisions within our community?</li>\n<li>Does the UX reflects our identity and priorities?</li>\n</ul>\n<p>Of course the Bonfire team have opinions about all of this. But we think our opinions are valid mostly for ourselves, and we do not want to impose our views upon others. There is a diversity of valid answers worth exploring.</p>\n<p>Social networking plays a critical role in our lives, and everyone should be able to decide how to define their online identities and how to interact with others, without an app imposing the boundaries of their experience in one way or another.</p>\n<h2 id=\"how-we're-building-it\">How we're building it <a class=\"direct-link\" href=\"#how-we're-building-it\">#</a></h2>\n<p>A Bonfire <a href=\"/apps/\">app (or flavour)</a> is basically a set of configurations that describes how a bunch of <a href=\"/extensions/\">extensions</a> should plug and play together.</p>\n<p>Extensions can include new sections in an existing page (e.g. a widget that shows one's most used hashtags on a user's profile page), whole new pages (e.g. a map page that shows me where my friends are located). They can use existing data from any extension (aggregating, transforming and filtering it to create meaningful and new information for the user), or new sets of information stored in the database.</p>\n<p>Imagine installing an identity extension that enables every user to define how to represent themselves online with fined-grained controls.</p>\n<p>Or installing the <a href=\"/extensions/valueFlows.html\">ValueFlows</a> extension, which can give the instance economic superpowers: users can now record the production or transfer of any kind of physical or non-tangible resource, keep track of inventories, assign tasks, record work done, and reward the community based on a set of parameters previously defined.</p>\n<p>Each community may need the ValueFlows extension for very different purposes. One instance may only need a <a href=\"/posts/bonfire_coordination/\">shared todo list</a>, and the whole economic network idea might be overwhelming for them. A mutual aid network on the other hand, may be looking to define and keep track of different types of economic resources and activities within their community, and would need a more detailed dashboard and set of pages, widgets and relationships between the data produced to deal with such level of complexity.</p>\n<p>That's how modularity really makes a difference: the ValueFlows extension does not impose a user experience or user interface. Based on each specific use case, users can pick (or create) a compatible UI extension that better fits their exact needs. Using the ValueFlows example, it means that so far we have more than 4 extensions: with data schemas and application logic in <a href=\"/extensions/valueFlows.html\">bonfire_valueflows</a>, reusable/customisable UI components in <a href=\"/extensions/ui_valueflows.html\">bonfire_ui_valueflows</a>, todo/coordination UI in <a href=\"/extensions/ui_coordination.html\">bonfire_ui_coordination</a>, mutual aid UI in <a href=\"/extensions/breadpub.html\">bonfire_breadpub</a>...</p>\n<h2 id=\"federation-will-be-a-mess\">Federation will be a mess <a class=\"direct-link\" href=\"#federation-will-be-a-mess\">#</a></h2>\n<p>Yes, and it will be fun!</p>\n<p>Each instance will likely have to deal with different and sometime unknown data types that will come through federation from users of other instances.</p>\n<p>Imagine an extension for book lovers, used to catalog, recommend, and review books. It will likely have a specific way to represent such activities in feeds with a set of actions to perform over them (add to reading list, review, reply...).</p>\n<p>Other instances may not have that extension installed, so they will have to decide how to handle unknown activities, if and how display them (this is because on the &quot;fediverse&quot;, users from different instances running different software can all follow each other).</p>\n<p>An instance (or individual user) could choose to display the unknown activities, using a preview widget contributed by the authors of the book lovers extension (and added to a shared Bonfire extension used by all instance, such as <a href=\"/extensions/social.html\">bonfire_social</a>), or deal with unknown activities using a default component which shows only the main information (such as a title, summary and link) formatted in a standard way, or just not displaying extra activities in feeds.</p>\n<p>That's quite a new usability challenge, which seems inevitable when dealing with the fediverse and open networks in general, and one we are embracing as a way of welcoming and encouraging diversity and plurality - rather than hiding them away for the sake of &quot;clean UX&quot;.</p>\n",
      "date_published": "2021-07-20T00:00:00Z"
    },{
      "id": "https://bonfirenetworks.org/posts/bonfire_coordination/",
      "url": "https://bonfirenetworks.org/posts/bonfire_coordination/",
      "title": "First steps toward federated project coordination",
      "content_html": "<h3 id=\"tl%3Bdr\">tl;dr <a class=\"direct-link\" href=\"#tl%3Bdr\">#</a></h3>\n<p>In March 2021, the Bonfire project was awarded a <a href=\"https://nlnet.nl/discovery/\">&quot;Next Generation Search &amp; Discovery&quot; grant</a> from NLNet Foundation, and since then the team has been working on a series of Bonfire extensions to help create the next generation of federated software.</p>\n<p>This is the first of a series of posts discussing the development process, work coordination strategies and the challenges we are currently facing.</p>\n<p>One of the funded <a href=\"https://github.com/bonfire-networks/bonfire-app/milestone/7\">milestones</a> led us to build a project coordination app as a bonfire extension and <a href=\"https://bonfirenetworks.org/apps/\">flavour</a>.</p>\n<h2 id=\"but-wait%3A-why-are-you-building-another-project-coordination-app%3F\">But wait: why are you building another project coordination app? <a class=\"direct-link\" href=\"#but-wait%3A-why-are-you-building-another-project-coordination-app%3F\">#</a></h2>\n<p><img src=\"https://i.imgur.com/VFz9YMY.png\" alt=\"\"></p>\n<p>Our coordination tool shares a lot of functionality with most to-do apps out there - you can create lists, add tasks to lists, commit to complete work, set a due date, and so on...</p>\n<p><em>So how is this different?</em></p>\n<h3 id=\"1)-we-want-to-federate-coordination-between-many-people%2C-groups-and-organisations-on-different-instances\">1) We want to federate coordination between many people, groups and organisations on different instances <a class=\"direct-link\" href=\"#1)-we-want-to-federate-coordination-between-many-people%2C-groups-and-organisations-on-different-instances\">#</a></h3>\n<p>On top of the usual features like writing posts, following users and browsing feeds, a Bonfire instance using the coordination extension will make it possible to create lists and tasks. Users can then favourite, boost, comment, flag and adjust the visibility settings (or in the case of a Bonfire instance, choose the boundaries and circles their lists and tasks are published to).</p>\n<p>As soon as users start publishing tasks, a new type of activity appears in the feeds like below:</p>\n<p><img src=\"https://i.imgur.com/E2Gu7s6.jpg\" alt=\"\"></p>\n<p>Users can interact with such activities by assigning a task to themselves, searching for tasks that fit with their skills or interests, or following a task to be notified about future discussions or progress.</p>\n<p>Users from any instance can thus start <strong>planning</strong> together: sofware projects, events, creative collaborations, peer production, etc - without having to leave the app and with the same account they already use.</p>\n<p>A user can decide to create a private list to share with specific people, or open it to all users of their instance or beyond. At every point the user will be able to control both the visibility (who can see todos or comments), as well as the permissions and roles for each list and task (who can add/edit/comment/vote/assign/etc).</p>\n<h3 id=\"2)-we-needed-it\">2) We needed it <a class=\"direct-link\" href=\"#2)-we-needed-it\">#</a></h3>\n<p>We are always seeking to improve the coordination between  contributors and the various projects linked to Bonfire. We aim to iterate on the design and build a p2p coordination system that we are happy to work with and would welcome other non-hierarchical and cooperative-minded groups to join us in designing and building these tools together.</p>\n<h3 id=\"3)-interoperability\">3) Interoperability <a class=\"direct-link\" href=\"#3)-interoperability\">#</a></h3>\n<h4 id=\"powered-by-valueflows\">Powered by ValueFlows <a class=\"direct-link\" href=\"#powered-by-valueflows\">#</a></h4>\n<p>We are building upon a well designed and tested <a href=\"https://valueflo.ws/\">vocabulary</a> to bring p2p coordination to a whole new level. In short, ValueFlows does for economic activities what <a href=\"https://www.w3.org/TR/activitystreams-core/#introduction\">ActivityStreams</a> (the main vocabulary of the <a href=\"https://activitypub.rocks/\">ActivityPub</a>-powered fediverse) does for social activities. Using these standard vocabularies means that every feature and user interaction can federate not only with other Bonfire instances, but also with instances of other software which implement them.</p>\n<p>Lists (which can represent projects or milestones within a larger project) can include dependencies from other lists, as well as tracking work, but also resources, shared inventories and needs (this ties in to our work around mutual aid, which will be the topic of a future blog post).</p>\n<p>Users can have discussions around a task, as well as record different kinds of economic activities to keep track of physical or digital resources. They can also simply log the amount of hours or the outputs (eg. git commits) of their work on a specific task.</p>\n<p>Furthermore, it will be possible to define formulas (aka <a href=\"https://valueflo.ws/appendix/equations.html\">value equations</a>) to help calculate the distribution of value generated by a project to all of its participants, based on their recorded contributions and previous agreements.</p>\n<p>So what looks on the surface like another to-do list app, is actually a small UI layer (the <a href=\"https://github.com/bonfire-networks/bonfire_ui_coordination\">bonfire_ui_coordination</a> extension, with only 1110 lines of code) on top of larger and more general economic extensions which are poised to be used for many different kinds of applications. These are <a href=\"https://github.com/bonfire-networks/bonfire_ui_valueflows\">bonfire_ui_valueflows</a> (which currently has over 2500 lines of reusable UI components) and <a href=\"https://github.com/bonfire-networks/bonfire_valueflows\">bonfire_valueflows</a> (sitting at a whopping 16150 lines of database and API schemas and logic), and <a href=\"https://bonfirenetworks.org/extensions/\">many more</a>...</p>\n<h4 id=\"forgefed\">ForgeFed <a class=\"direct-link\" href=\"#forgefed\">#</a></h4>\n<p>Besides ValueFlows, we plan to participate in the <a href=\"https://forgefed.peers.community/\">ForgeFed</a> effort.</p>\n<blockquote>\n<p>ForgeFed is an upcoming federation protocol for enabling interoperability between version control services. It is built as an extension to the ActivityPub protocol, allowing users of any ForgeFed-compliant service to interact with the repositories hosted on other instances.<br>\nThe goal of the project is to support all of the major activities connected to project management, including bug reports, merge requests and notifications across instances.</p>\n</blockquote>\n<p>Given that we are coordinating our development using this tool, it makes sense to connect the dots between issue reporting and work coordination, code contributions (version control and merge requests) and economic contributions (along with the related value calculations). We hope to implement ForgeFed functionality to do more of this and interoperate with other tools in the near future.</p>\n<h2 id=\"join-us!\">Join us! <a class=\"direct-link\" href=\"#join-us!\">#</a></h2>\n<p>Would you be interested in trying alpha-stage software and participate in its design and creation process? These tools are still missing some important features, several of which we've committed to build as part of other milestones, and we greatly appreciate your input about how to design and build it futher according to your needs. Please get in touch.</p>\n",
      "date_published": "2021-07-14T00:00:00Z"
    },{
      "id": "https://bonfirenetworks.org/posts/bonfire_identity/",
      "url": "https://bonfirenetworks.org/posts/bonfire_identity/",
      "title": "The story of Bonfire&#39;s visual identity",
      "content_html": "<blockquote>\n<p>Everyone carries a history of contamination, purity is not an option.</p>\n</blockquote>\n<p>This short statement by <a href=\"https://en.wikipedia.org/wiki/Anna_Tsing\">Anna Tsing</a> in <a href=\"https://en.wikipedia.org/wiki/The_Mushroom_at_the_End_of_the_World\">Mushroom at the end of the world</a> encompasses a lot of the visions and needs that inspired our work on Bonfire.</p>\n<p>We are building this piece of software for us and for the diverse communities we care about, so we strive for diversity and flexibility in every aspect of the Bonfire codebase.</p>\n<p>We want each Bonfire instance to be autonomous and unique in its own particular way, while having a shared purpose with the other bonfires:</p>\n<blockquote>\n<p>To create safe environments for users to inhabit and create their own culture together, while remaining in control of their personal data and experience, and being able to communicate with the fediverse at their own pace and on their own terms.</p>\n</blockquote>\n<p>It was no surprise that words like <strong>contamination</strong>, <strong>burn</strong>, <strong>revolution</strong>, <strong>rebirth</strong>, <strong>bottom up</strong>, <strong>diverse</strong>, <strong>autonomous</strong>, <strong>nature</strong> and <strong>ecosystem</strong> were among the most used during our brainstorming about Bonfire's visual identity.</p>\n<p>We wanted our visual identity to reflect such ideas without obfuscating itself under an overly sanitised and minimalist design. We enjoy navigating through complexity, without the burning desire to be in control of everything, and wanted to avoid the flat, metallo-plastic, stark, silicon valley style that has dominated the web in recent years.</p>\n<p>Other than a social network, Bonfire is a playground and experimentation platform, we are learning how to take care of it and take care of ourselves - building in the open so that Bonfire can become an ecosystem open to many other peers.</p>\n<p>We had the pleasure to work with <a href=\"http://lalberosfregiato.blogspot.com/\">Rocco Lombardi</a>, a talented artist living somewhere near the Bolognese Apennines, who guided us and turned our wishes into meaningful visual representations of the project.</p>\n<p>We asked Rocco to work on our visual identity primarly because of the style and subjects of his artwork. Forests and trees that emerge by scratching the light away from black paper, animals that fight capitalism, all sort of organics - wild and lived entities contaminate his drawings and we wanted that world to contaminate our software as well.</p>\n<p><img src=\"https://assets.bigcartel.com/product_images/287784678/Squirrels.jpg?auto=format&amp;fit=max&amp;w=600\" alt=\"\"></p>\n<figcaption class=\"-mt-6 italic text-blueGray-400 text-base block\">\"Squirrels on the air\" - Illustration by Rocco Lombardi - <a href=\"https://roccolombardi.bigcartel.com/product/squirrels-on-the-air\" target=\"blank\">Link</a></figcaption>\n<p>The end result is very much in tune with our expectations, and we hope you like it too.</p>\n<p>As we're progressing toward a first release of our software, we are happy to have added this important step and we thank Rocco to have joined us on this journey. :-)</p>\n<img src=\"/img/brand2.png\">\n",
      "date_published": "2021-05-21T00:00:00Z"
    }
  ]
}
